Repository: dforsi/tihos
Catalog: po/*.po
Languages: fi

source: Force USB
fi: Pakota USB

source: Profile: music
fi: Profiili: musiikki

source: Profile: phone
fi: Profiili: puhelin

source: USB host mode
fi: USB-isäntätila

source: Rotate
fi: Kierrä

source: Restart
fi: Käynn. uud.

source: BT net fw
fi: BT-verkkofwd

source: GPRS off
fi: GPRS pois

source: GPRS on
fi: GPRS päälle

source: GPS off
fi: GPS pois

source: GPS on
fi: GPS päälle

source: Bluetooth off
fi: Bluetooth pois

source: Bluetooth on
fi: Bluetooth päälle

source: WLAN off
fi: WLAN pois

source: WLAN on
fi: WLAN päälle

source: 3G On
fi: 3G päälle

source: POWER OFF
fi: VIRTA POIS

source: Toggle tray
fi: Ilmoitusalue

source: Bat: %d%% +
fi: Akku: %d%% +

source: Bat: %d%%
fi: Akku: %d%%

source: Lock screen
fi: Lukitse näyttö

source: Keyboard
fi: Näppäimistö

source: Applications
fi: Sovellukset

source: Close App (tap twice)
fi: Sulje sov (2 x)

source: More...
fi: Lisää...

source: Bat: ? %
fi: Akku: ? %

source: Home screen application for Neo FreeRunner mobile phone
fi: Kotinäyttösovellus Neo FreeRunner -matkapuhelimelle
